Revit 2026 API

# StairsRunGetAllSupports Method

---

Retrieves all supports hosted by the stair's run.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<ElementId> GetAllSupports()
```
```vb
Public Function GetAllSupports As IList(Of ElementId)
```
```cpp
public:
IList<ElementId^>^ GetAllSupports()
```
```fsharp
member GetAllSupports : unit -> IList<ElementId>
```

#### Return Value

IListElementId All supports hosted by the stair's run.

The supports consist of left, right, and middle supports of the stair's run.

#### Reference

StairsRun Class

Autodesk.Revit.DB.Architecture Namespace